Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GA110.h
#define _CNPU3_CN36PUE_POSITION                  0x00000004
#define _CNPU3_CN36PUE_MASK                      0x00000010
#define _CNPU3_CN36PUE_LENGTH                    0x00000001

#define _CNPU3_CN37PUE_POSITION                  0x00000005
#define _CNPU3_CN37PUE_MASK                      0x00000020
#define _CNPU3_CN37PUE_LENGTH                    0x00000001

#define _CNPU3_CN38PUE_POSITION                  0x00000006
#define _CNPU3_CN38PUE_MASK                      0x00000040
#define _CNPU3_CN38PUE_LENGTH                    0x00000001

#define _CNPU3_CN39PUE_POSITION                  0x00000007
#define _CNPU3_CN39PUE_MASK                      0x00000080
#define _CNPU3_CN39PUE_LENGTH                    0x00000001

#define _CNPU3_CN40PUE_POSITION                  0x00000008
#define _CNPU3_CN40PUE_MASK                      0x00000100
#define _CNPU3_CN40PUE_LENGTH                    0x00000001

#define _CNPU3_CN41PUE_POSITION                  0x00000009
#define _CNPU3_CN41PUE_MASK                      0x00000200
#define _CNPU3_CN41PUE_LENGTH                    0x00000001

#define _CNPU3_CN42PUE_POSITION                  0x0000000A
#define _CNPU3_CN42PUE_MASK                      0x00000400
#define _CNPU3_CN42PUE_LENGTH                    0x00000001

#define _CNPU3_CN43PUE_POSITION                  0x0000000B
#define _CNPU3_CN43PUE_MASK                      0x00000800
#define _CNPU3_CN43PUE_LENGTH                    0x00000001

#define _CNPU3_CN44PUE_POSITION                  0x0000000C
#define _CNPU3_CN44PUE_MASK                      0x00001000
#define _CNPU3_CN44PUE_LENGTH                    0x00000001

#define _CNPU3_CN45PUE_POSITION                  0x0000000D
#define _CNPU3_CN45PUE_MASK                      0x00002000
#define _CNPU3_CN45PUE_LENGTH                    0x00000001

#define _CNPU3_CN46PUE_POSITION                  0x0000000E
#define _CNPU3_CN46PUE_MASK                      0x00004000
#define _CNPU3_CN46PUE_LENGTH                    0x00000001

#define _CNPU3_CN47PUE_POSITION                  0x0000000F
#define _CNPU3_CN47PUE_MASK                      0x00008000
#define _CNPU3_CN47PUE_LENGTH                    0x00000001

#define _CNPU4_CN48PUE_POSITION                  0x00000000
#define _CNPU4_CN48PUE_MASK                      0x00000001
#define _CNPU4_CN48PUE_LENGTH                    0x00000001

#define _CNPU4_CN49PUE_POSITION                  0x00000001
#define _CNPU4_CN49PUE_MASK                      0x00000002
#define _CNPU4_CN49PUE_LENGTH                    0x00000001

#define _CNPU4_CN50PUE_POSITION                  0x00000002
#define _CNPU4_CN50PUE_MASK                      0x00000004
#define _CNPU4_CN50PUE_LENGTH                    0x00000001

#define _CNPU4_CN51PUE_POSITION                  0x00000003
#define _CNPU4_CN51PUE_MASK                      0x00000008
#define _CNPU4_CN51PUE_LENGTH                    0x00000001

#define _CNPU4_CN52PUE_POSITION                  0x00000004
#define _CNPU4_CN52PUE_MASK                      0x00000010
#define _CNPU4_CN52PUE_LENGTH                    0x00000001

#define _CNPU4_CN53PUE_POSITION                  0x00000005
#define _CNPU4_CN53PUE_MASK                      0x00000020
#define _CNPU4_CN53PUE_LENGTH                    0x00000001

#define _CNPU4_CN54PUE_POSITION                  0x00000006
#define _CNPU4_CN54PUE_MASK                      0x00000040
#define _CNPU4_CN54PUE_LENGTH                    0x00000001

#define _CNPU4_CN55PUE_POSITION                  0x00000007
#define _CNPU4_CN55PUE_MASK                      0x00000080
#define _CNPU4_CN55PUE_LENGTH                    0x00000001

#define _CNPU4_CN56PUE_POSITION                  0x00000008
#define _CNPU4_CN56PUE_MASK                      0x00000100
#define _CNPU4_CN56PUE_LENGTH                    0x00000001

#define _CNPU4_CN57PUE_POSITION                  0x00000009
#define _CNPU4_CN57PUE_MASK                      0x00000200
#define _CNPU4_CN57PUE_LENGTH                    0x00000001

#define _CNPU4_CN58PUE_POSITION                  0x0000000A
#define _CNPU4_CN58PUE_MASK                      0x00000400
#define _CNPU4_CN58PUE_LENGTH                    0x00000001

#define _CNPU4_CN59PUE_POSITION                  0x0000000B
#define _CNPU4_CN59PUE_MASK                      0x00000800
#define _CNPU4_CN59PUE_LENGTH                    0x00000001

#define _CNPU4_CN60PUE_POSITION                  0x0000000C
#define _CNPU4_CN60PUE_MASK                      0x00001000
#define _CNPU4_CN60PUE_LENGTH                    0x00000001

#define _CNPU4_CN61PUE_POSITION                  0x0000000D
#define _CNPU4_CN61PUE_MASK                      0x00002000
#define _CNPU4_CN61PUE_LENGTH                    0x00000001

#define _CNPU4_CN62PUE_POSITION                  0x0000000E
#define _CNPU4_CN62PUE_MASK                      0x00004000
#define _CNPU4_CN62PUE_LENGTH                    0x00000001

#define _CNPU4_CN63PUE_POSITION                  0x0000000F
#define _CNPU4_CN63PUE_MASK                      0x00008000
#define _CNPU4_CN63PUE_LENGTH                    0x00000001

#define _CNPU5_CN64PUE_POSITION                  0x00000000
#define _CNPU5_CN64PUE_MASK                      0x00000001
#define _CNPU5_CN64PUE_LENGTH                    0x00000001

#define _CNPU5_CN65PUE_POSITION                  0x00000001
#define _CNPU5_CN65PUE_MASK                      0x00000002
#define _CNPU5_CN65PUE_LENGTH                    0x00000001

#define _CNPU5_CN66PUE_POSITION                  0x00000002
#define _CNPU5_CN66PUE_MASK                      0x00000004
#define _CNPU5_CN66PUE_LENGTH                    0x00000001

#define _CNPU5_CN67PUE_POSITION                  0x00000003
#define _CNPU5_CN67PUE_MASK                      0x00000008
#define _CNPU5_CN67PUE_LENGTH                    0x00000001

#define _CNPU5_CN68PUE_POSITION                  0x00000004
#define _CNPU5_CN68PUE_MASK                      0x00000010
#define _CNPU5_CN68PUE_LENGTH                    0x00000001

#define _CNPU5_CN69PUE_POSITION                  0x00000005
#define _CNPU5_CN69PUE_MASK                      0x00000020
#define _CNPU5_CN69PUE_LENGTH                    0x00000001

#define _CNPU5_CN70PUE_POSITION                  0x00000006
#define _CNPU5_CN70PUE_MASK                      0x00000040
#define _CNPU5_CN70PUE_LENGTH                    0x00000001

#define _CNPU5_CN71PUE_POSITION                  0x00000007
#define _CNPU5_CN71PUE_MASK                      0x00000080
#define _CNPU5_CN71PUE_LENGTH                    0x00000001

#define _CNPU5_CN72PUE_POSITION                  0x00000008
#define _CNPU5_CN72PUE_MASK                      0x00000100
#define _CNPU5_CN72PUE_LENGTH                    0x00000001

#define _CNPU5_CN73PUE_POSITION                  0x00000009
#define _CNPU5_CN73PUE_MASK                      0x00000200
#define _CNPU5_CN73PUE_LENGTH                    0x00000001

