Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GA110.h
#define WPFP_WPFP0           0xFE00
#define WPFP_WPFP1           0xFE01
#define WPFP_WPFP2           0xFE02
#define WPFP_WPFP3           0xFE03
#define WPFP_WPFP4           0xFE04
#define WPFP_WPFP5           0xFE05
#define WPFP_WPFP6           0xFE06
#define WPFP_WPFP7           0xFE07
#define WPFP_WPFP8           0xFE08
#define WPFP_WPFP9           0xFE09
#define WPFP_WPFP10          0xFE0A
#define WPFP_WPFP11          0xFE0B
#define WPFP_WPFP12          0xFE0C
#define WPFP_WPFP13          0xFE0D
#define WPFP_WPFP14          0xFE0E
#define WPFP_WPFP15          0xFE0F
#define WPFP_WPFP16          0xFE10
#define WPFP_WPFP17          0xFE11
#define WPFP_WPFP18          0xFE12
#define WPFP_WPFP19          0xFE13
#define WPFP_WPFP20          0xFE14
#define WPFP_WPFP21          0xFE15
#define WPFP_WPFP22          0xFE16
#define WPFP_WPFP23          0xFE17
#define WPFP_WPFP24          0xFE18
#define WPFP_WPFP25          0xFE19
#define WPFP_WPFP26          0xFE1A
#define WPFP_WPFP27          0xFE1B
#define WPFP_WPFP28          0xFE1C
#define WPFP_WPFP29          0xFE1D
#define WPFP_WPFP30          0xFE1E
#define WPFP_WPFP31          0xFE1F
#define WPFP_WPFP32          0xFE20
#define WPFP_WPFP33          0xFE21
#define WPFP_WPFP34          0xFE22
#define WPFP_WPFP35          0xFE23
#define WPFP_WPFP36          0xFE24
#define WPFP_WPFP37          0xFE25
#define WPFP_WPFP38          0xFE26
#define WPFP_WPFP39          0xFE27
#define WPFP_WPFP40          0xFE28
#define WPFP_WPFP41          0xFE29
#define WPFP_WPFP42          0xFE2A
#define WPFP_WPFP43          0xFE2B
#define WPFP_WPFP44          0xFE2C
#define WPFP_WPFP45          0xFE2D
#define WPFP_WPFP46          0xFE2E
#define WPFP_WPFP47          0xFE2F
#define WPFP_WPFP48          0xFE30
#define WPFP_WPFP49          0xFE31
#define WPFP_WPFP50          0xFE32
#define WPFP_WPFP51          0xFE33
#define WPFP_WPFP52          0xFE34
#define WPFP_WPFP53          0xFE35
#define WPFP_WPFP54          0xFE36
#define WPFP_WPFP55          0xFE37
#define WPFP_WPFP56          0xFE38
#define WPFP_WPFP57          0xFE39
#define WPFP_WPFP58          0xFE3A
#define WPFP_WPFP59          0xFE3B
#define WPFP_WPFP60          0xFE3C
#define WPFP_WPFP61          0xFE3D
#define WPFP_WPFP62          0xFE3E
#define WPFP_WPFP63          0xFE3F
#define WPFP_WPFP64          0xFE40
#define WPFP_WPFP65          0xFE41
#define WPFP_WPFP66          0xFE42
#define WPFP_WPFP67          0xFE43
#define WPFP_WPFP68          0xFE44
#define WPFP_WPFP69          0xFE45
#define WPFP_WPFP70          0xFE46
#define WPFP_WPFP71          0xFE47
#define WPFP_WPFP72          0xFE48
#define WPFP_WPFP73          0xFE49
#define WPFP_WPFP74          0xFE4A
#define WPFP_WPFP75          0xFE4B
#define WPFP_WPFP76          0xFE4C
#define WPFP_WPFP77          0xFE4D
#define WPFP_WPFP78          0xFE4E
#define WPFP_WPFP79          0xFE4F
#define WPFP_WPFP80          0xFE50
#define WPFP_WPFP81          0xFE51
#define WPFP_WPFP82          0xFE52
#define WPFP_WPFP83          0xFE53
#define WPFP_WPFP84          0xFE54
#define WPFP_WPFP85          0xFE55
#define WPFP_WPFP511         0xFFFF

#define WPDIS_WPEN           0xDFFF
#define WPDIS_WPDIS          0xFFFF

#define WPCFG_WPCFGEN        0xBFFF
#define WPCFG_WPCFGDIS       0xFFFF

#define WPEND_WPSTARTMEM     0x7FFF
#define WPEND_WPENDMEM       0xFFFF

/* Register CONFIG2 (0x157fc)                               */

extern __attribute__((space(prog))) unsigned int _CONFIG2;
#define _CONFIG2(x) __attribute__((section("__CONFIG2.sec"),space(prog))) unsigned int _CONFIG2 = (x);

/*
** Only one invocation of CONFIG2 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set CONFIG2.
** Multiple options may be combined, as shown:
**
** _CONFIG2( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Select:
**     POSCMOD_EC           EC oscillator mode selected
**     POSCMOD_XT           XT oscillator mode selected
**     POSCMOD_HS           HS oscillator mode selected
**     POSCMOD_NONE         Primary oscillator disabled
**
**   I2C2 Pin Select bit:
**     I2C2SEL_SEC          Use alternate ASCL2/ASDA2 pins for I2C2
**     I2C2SEL_PRI          Use Default SCL2/SDA2 pins for I2C2
**
**   IOLOCK One-Way Set Enable bit:
**     IOL1WAY_OFF          Unlimited Writes To RP Registers
**     IOL1WAY_ON           Write RP Registers Once
**
**   Primary Oscillator Output Function:
**     OSCIOFNC_ON          OSCO functions as port I/O (RC15)
**     OSCIOFNC_OFF         OSCO functions as CLKO (FOSC/2)
**
**   Clock Switching and Monitor:
**     FCKSM_CSECME         Both Clock switching and Fail-safe Clock Monitor are enabled
**     FCKSM_CSECMD         Clock switching is enabled, Fail-safe Clock Monitor is disabled
**     FCKSM_CSDCMD         Both Clock Switching and Fail-safe Clock Monitor are disabled
**
**   Oscillator Select:
**     FNOSC_FRC            Fast RC Oscillator (FRC)
**     FNOSC_FRCPLL         Fast RC oscillator with Postscaler and PLL module (FRCPLL)
**     FNOSC_PRI            Primary oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary oscillator (XT, HS, EC) with PLL module (XTPLL,HSPLL, ECPLL)
**     FNOSC_SOSC           Secondary oscillator (SOSC)
**     FNOSC_LPRC           Low-Power RC oscillator (LPRC)
**     FNOSC_FRCDIV         Fast RC oscillator with Postscaler (FRCDIV)
**
**   Internal External Switch Over Mode:
**     IESO_OFF             IESO mode (Two-speed start-up)disabled
**     IESO_ON              IESO mode (Two-speed start-up) enabled
**
*/

#define POSCMOD_EC           0xFFFC
#define POSCMOD_XT           0xFFFD
#define POSCMOD_HS           0xFFFE
#define POSCMOD_NONE         0xFFFF

#define I2C2SEL_SEC          0xFFFB
#define I2C2SEL_PRI          0xFFFF

#define IOL1WAY_OFF          0xFFEF
#define IOL1WAY_ON           0xFFFF

#define OSCIOFNC_ON          0xFFDF
#define OSCIOFNC_OFF         0xFFFF

#define FCKSM_CSECME         0xFF3F
#define FCKSM_CSECMD         0xFF7F
#define FCKSM_CSDCMD         0xFFBF

#define FNOSC_FRC            0xF8FF
#define FNOSC_FRCPLL         0xF9FF
#define FNOSC_PRI            0xFAFF
#define FNOSC_PRIPLL         0xFBFF
#define FNOSC_SOSC           0xFCFF
#define FNOSC_LPRC           0xFDFF
#define FNOSC_FRCDIV         0xFFFF

#define IESO_OFF             0x7FFF
#define IESO_ON              0xFFFF

/* Register CONFIG1 (0x157fe)                               */

extern __attribute__((space(prog))) unsigned int _CONFIG1;
#define _CONFIG1(x) __attribute__((section("__CONFIG1.sec"),space(prog))) unsigned int _CONFIG1 = (x);

